# MultiplanarDepth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerItem..::..MultiplanarDepth Property
RebarContainerItem Class See Also
---
For a multiplanar rebar, the depth of the instance.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double MultiplanarDepth { get; set; }
```

Visual Basic
---
```text
Public Property MultiplanarDepth As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MultiplanarDepth {
	double get ();
	void set (double value);
}
```

# Remarks
Applicable only when an instance of a RebarShape with a RebarShapeMultiplanarDefinition.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: multiplanarDepth must be positive. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This RebarContainerItem is not an instance of a multiplanar shape. |

# See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace